//********************************************************************************************************************
// タイトル:		シーン処理
// プログラム名:	scene3D.h
//********************************************************************************************************************
#ifndef _SCENE3D_H_
#define _SCENE3D_H_

//********************************************************************************************************************
// インクルードファイル
//********************************************************************************************************************
#include "main.h"
#include "scene.h"

//********************************************************************************************************************
// クラス
//********************************************************************************************************************
// シーンクラス
class CScene3D : public CScene
{
public:
	CScene3D();								// コンストラクタ
	~CScene3D();							// デストラクタ
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	LPDIRECT3DTEXTURE9		m_pTexture;		// テクスチャへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;		// 頂点バッファへのポインタ
	D3DXMATRIX				m_mtxWorld;		// ワールドマトリックス
	D3DXVECTOR3				m_pos;			// ワールド空間における位置
	D3DXVECTOR3				m_rot;			// 回転角
	D3DXVECTOR3				m_scl;			// 大きさ(スケール)
};

#endif
