//********************************************************************************************************************
// タイトル:		バレット処理
// プログラム名:	bullet.h
//********************************************************************************************************************
#ifndef _BULLET_H_
#define _BULLET_H_

//********************************************************************************************************************
// インクルードファイル
//********************************************************************************************************************
#include "main.h"
#include "scene2D.h"

//********************************************************************************************************************
// クラス
//********************************************************************************************************************
// シーンクラス
class CBullet : public CScene2D
{
public:
	CBullet();							// コンストラクタ
	~CBullet();							// デストラクタ
	static CBullet* Create(int nType, D3DXVECTOR3 pos, D3DXVECTOR3 rot);
	HRESULT Init(int nType, D3DXVECTOR3 pos, D3DXVECTOR3 rot);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static HRESULT Load(void);
	static void Unload(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
	D3DXVECTOR3 m_move;
};

#endif