//********************************************************************************************************************
// タイトル:		プレイヤー処理
// プログラム名:	player.h
//********************************************************************************************************************
#ifndef _PLAYER_H_
#define _PLAYER_H_

//********************************************************************************************************************
// インクルードファイル
//********************************************************************************************************************
#include "main.h"
#include "scene2D.h"

//********************************************************************************************************************
// クラス
//********************************************************************************************************************
// シーンクラス
class CPlayer : public CScene2D
{
public:
	CPlayer();							// コンストラクタ
	~CPlayer();							// デストラクタ
	static CPlayer* Create(int nType, D3DXVECTOR3 pos, D3DXVECTOR3 rot);
	HRESULT Init(int nType, D3DXVECTOR3 pos, D3DXVECTOR3 rot);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static HRESULT Load(void);
	static void Unload(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;
};

#endif